<template>
  <div>
    <h1>รายการคำร้อง</h1>
    <b-table :items="items" :fields="fields" striped responsive="sm">
      <template #cell(การดำเนินการ)>
        <b-button size="sm" class="mr-2" to="/pettitiondetail">ดูรายละเอียด</b-button>
      </template>
    </b-table>
  </div>
</template>

<script>
export default {
  data () {
    return {
      fields: ['หมายเลขการจอง', 'ชื่อผู้จอง', 'วันที่จอง', 'เวลา', 'การดำเนินการ'],
      items: [
        {
          isActive: false,
          หมายเลขการจอง: 1,
          ชื่อผู้จอง: 'นายศรันย์ ยิ่งยง',
          วันที่จอง: '11-03-2565',
          เวลา: '14:00 - 16:00',
          การดำเนินการ: ''
        },
        {
          isActive: false,
          หมายเลขการจอง: 1,
          ชื่อผู้จอง: 'นายศรันย์ ยิ่งยง',
          วันที่จอง: '11-03-2565',
          เวลา: '14:00 - 16:00',
          การดำเนินการ: ''
        },
        {
          isActive: false,
          หมายเลขการจอง: 1,
          ชื่อผู้จอง: 'นายศรันย์ ยิ่งยง',
          วันที่จอง: '11-03-2565',
          เวลา: '14:00 - 16:00',
          การดำเนินการ: ''
        },
        {
          isActive: false,
          หมายเลขการจอง: 1,
          ชื่อผู้จอง: 'นายศรันย์ ยิ่งยง',
          วันที่จอง: '11-03-2565',
          เวลา: '14:00 - 16:00',
          การดำเนินการ: ''
        }
      ]
    }
  }
}
//
</script>
